<template>
  <section>
    <div class="md:w-10 lg:w-8 mx-auto p-3">
      <div class="card flex align-items-center ">
        <Breadcrumb :model="items" >
          
        </Breadcrumb>
      </div>

      <h2 class="text-900 my-5" style="font-size: 41px;">{{ currentDoc.title }}</h2>

      <div v-for="item in currentDoc.paragraphs" :key="item">
        <h3 class="text-900 my-4" style="font-size: 24px;">{{ item.title }}</h3>

        <p v-html="item.text" style="font-size: 18px; font-weight: 400;"></p>
      </div>
    </div>
  </section>
</template>

<script setup>

import { onMounted, ref, watch } from "vue";
import { useRouter } from "vue-router";

const router = useRouter()


const items = ref([
  { label: 'Главная страница', url: '/' },
  { label: 'Документы' },
  { label: '' }
]);

const currentDoc = ref({});

onMounted(() => {
  currentDoc.value = data.value.find(item => item.id === Number(router.currentRoute.value.params.id))
})

watch(() => {
  if (currentDoc.value) {
    items.value[2].label = currentDoc.value.title
  }
})
const data = ref([
  {
    id: 1,
    title: 'Лицензионный договор',
    paragraphs: [
      {
        title: "Заголовок 1",
        text: "Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. Тележка прекрасно подходит для использования во дворах многоквартирных домов, обработки территорий промышленных предприятий, востребована владельцами магазинов, различных коммерческих компаний. Кроме того, она может использоваться для высева семян на газонах, теннисных кортах и других территориях. <br> <br> Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. "
      },
      {
        title: "Заголовок 2",
        text: "Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. "
      },
      {
        title: "Заголовок 3",
        text: "Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. Тележка прекрасно подходит для использования во дворах многоквартирных домов, обработки территорий промышленных предприятий, востребована владельцами магазинов, различных коммерческих компаний. Кроме того, она может использоваться для высева семян на газонах, теннисных кортах и других территориях. <br> <br> Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. "
      }
    ]
  },
  {
    id: 2,
    title: 'Политика обработки персональных данных',
    paragraphs: [
      {
        title: "Заголовок 1",
        text: "Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. Тележка прекрасно подходит для использования во дворах многоквартирных домов, обработки территорий промышленных предприятий, востребована владельцами магазинов, различных коммерческих компаний. Кроме того, она может использоваться для высева семян на газонах, теннисных кортах и других территориях. <br> <br> Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. "
      },
      {
        title: "Заголовок 2",
        text: "Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. "
      },
      {
        title: "Заголовок 3",
        text: "Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. Тележка прекрасно подходит для использования во дворах многоквартирных домов, обработки территорий промышленных предприятий, востребована владельцами магазинов, различных коммерческих компаний. Кроме того, она может использоваться для высева семян на газонах, теннисных кортах и других территориях. <br> <br> Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. "
      }
    ]
  },
  {
    id: 3,
    title: 'Информация об оплате',
    paragraphs: [
      {
        title: "Заголовок 1",
        text: "Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. Тележка прекрасно подходит для использования во дворах многоквартирных домов, обработки территорий промышленных предприятий, востребована владельцами магазинов, различных коммерческих компаний. Кроме того, она может использоваться для высева семян на газонах, теннисных кортах и других территориях. <br> <br> Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. "
      },
      {
        title: "Заголовок 2",
        text: "Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. "
      },
      {
        title: "Заголовок 3",
        text: "Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. Тележка прекрасно подходит для использования во дворах многоквартирных домов, обработки территорий промышленных предприятий, востребована владельцами магазинов, различных коммерческих компаний. Кроме того, она может использоваться для высева семян на газонах, теннисных кортах и других территориях. <br> <br> Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. "
      }
    ]
  }

])


</script>

<style lang="scss" scoped></style>